package taven.enum
{
	public class StringConst
	{
		/**--------------------------------------------------------------------------------------默认图标 当图片未加载时--------------------------------------------------------------------------------------*/
		public static const  DEFAULT_IMG:String ="http://192.168.10.230:8088/gift/gift_icon/100001.png"  ;  //用户面板  点击头像
		
		public static var   IS_DEBUG:Boolean =true ;  //用户面板  点击头像
		
		/**--------------------------------------------------------------------------------------礼物列表--------------------------------------------------------------------------------------*/
		public static const  GIFT_NUM:String ="{0}个";    //用户面板  点击头像
		public static const  GIFT_NAME:String ="送{0}";    //用户面板  点击头像
		/**--------------------------------------------------------------------------------------个人信息--------------------------------------------------------------------------------------*/
		public static const  PERSON_MAIL_MAX_LEN:String ="还能输入200字";    //用户面板  点击头像
			
			
	}
}